[
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "C10B294E685A426EB45B3FAAC9F3AB35",
        "reqid": "2864BR",
        "description": "Job Overview:\n  \n\n  \nDigital is a rapidly growing and critical area at Dollar Bank.  As the AVP Digital Design you will be responsible for creating an outstanding and unique digital customer experience for our retail and business customers while coordinating consistent branding and look & feel across all digital properties.  This role plays an important and influential role for the business, working closely with product managers, communications professionals, developers and stakeholders to bring the product/service to life. We are seeking a mix of skill sets - including information architecture, wire framing, visual design, interactive design, and prototyping.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Web Design, Interaction Design, Multimedia, Visual Design, or related UX/UI field and minimum 5 years’ experience in interaction or user experience design required. Will consider commensurate experience.\n  \n• Strong portfolio of work showcasing engaging user-centered design solutions.\n  \n• Transactional site design & user experience (online, mobile app, B2C, B2B) preferred.\n  \n• Human interaction experience with digital interfaces required.\n  \n• Proven ability to create, run, and manage customer surveys, design research, and focus groups with customers/non-customers.\n  \n• Familiar with MVC, CSS, jQuery, JavaScript a plus.\n  \n• Working knowledge of CMS.\n  \n• Solid understanding of usability principles, user-centered design methods, and interaction design patterns.\n  \n• Proven ability to maximize SEO results, as well as a solid understanding of optimizing account opening and new customer onboarding via digital.\n  \n• Fluency with InDesign, Illustrator, Photoshop, and Keynote.\n  \n• Practical understanding of HTML 5, JavaScript and CSS preprocessing frameworks.\n  \n• Proven understanding of brand development and representation in the digital space.\n  \n• Ability to create detailed design specifications and mockups to communicate design intent.\n  \n• Understanding of ADA compliance and other design and technical regulations and requirements in the digital space.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Be the UX/UI expert for all digital platforms for retail and business banking.\n  \n• Delivering unique and innovative designs and experiences across multiple applications, products and payments offerings.\n  \n• Turn complex engagements into simple and engaging customer experiences for web, iPad/iPhone, and Android.\n  \n• Create HTML/Java-based wireframes, workflows, storyboards, and navigation maps that deliver a seamless user experience.\n  \n• Effectively communicate and defend design choices, advocating for the customer.\n  \n• Collaborate with digital and bank product managers and developers to understand objectives and constraints.\n  \n• Lead customer research to design and observe user studies and translate research findings into insights and design improvements.\n  \n• Be able to understand the differences and nuances inherent in the major mobile operating systems and device types – iOS, Android, smartphone, tablet.\n  \n• Be able to translate high level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\n  \n• Stay current on and be the SME for competitive UI/UX for banking as well as other digital experiences that influence digital banking customers’ expectations.\n  \n• Work with marketing to maximize SEO results, website management and utilization of bank’s graphic standards.\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  3 Gateway Center Lobby\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:15am - 4:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/C10B294E685A426EB45B3FAAC9F3AB3524",
        "title": "AVP Digital User Experience",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-08 04:09:15"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "3E02D88195D240CD8156DAD81DFFC41B",
        "reqid": "2860BR",
        "description": "Job Overview:\n  \n\n  \nResponsible for working with Information Technology and the Business Areas within Dollar Bank and making sure their needs are understood and delivered, while also ensuring that the needs align with the overall Information Technology strategy.  Develops the Business Requirements (functional and non-functional), Use Cases and required artifacts for projects from initiation through implementation and provides consistent communication with the stakeholders to make sure requirements are being delivered. Follows the adopted Change Management protocol and adheres to project management processes to ensure projects are delivered successfully.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Information Technology or related field required. Will consider commensurate experience\n  \n• Exceptional written and verbal communication that includes good listening skills and an open attitude and acceptance to coaching and being coached\n  \n• Demonstrated experience working on projects\n  \n• Strong organizational and analytical skills\n  \n• Demonstrated organization and team building skills\n  \n• Excellent teamwork and collaboration skills\n  \n• Demonstrated leadership skills\n  \n• Knowledge of Microsoft Office Tools\n  \n• Able to manage simultaneous projects\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Interview Subject Matter Experts to extract the business case for a project and potential impacts\n  \n• Utilize both waterfall and agile development methodologies\n  \n• Facilitate stakeholders on process, strategy, and investments to achieve the enterprise business and IT strategy\n  \n• Negotiate scopes/requirements documentation with stakeholders\n  \n• Aligns with the internal Business Groups to determine their needs, develops business requirements and manage their expectations throughout the project lifecycle\n  \n• Coordinates and facilitates project requirement meetings\n  \n• Maintains communication with all project stakeholders\n  \n• Addresses problems through risk management and contingency planning and presents solutions and/or options to the Project Manager and executive management\n  \n• Monitors effectiveness of project management processes and methodologies; recommends improvements as necessary\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:00am - 4:15pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/3E02D88195D240CD8156DAD81DFFC41B24",
        "title": "IT Requirements Analyst I",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-03 03:34:57"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "D73ABB47673C4CD0B2CBEE8AA2FBF328",
        "reqid": "2845BR",
        "description": "Job Overview\n  \n\n  \nThis position is responsible for providing system health monitoring, troubleshooting, system maintenance and server support for the Distributed Services Infrastructure Support Department. The Department is responsible for the management of over 600 servers, both physical and virtual, over 100 Microsoft SQL Databases, over 150 business applications and over 80 branches throughout the Eastern United States.\n  \n\n  \nQualifications\n  \n\n  \n• Bachelor’s Degree in Computer Science, Information Systems or another related field is required.  Will accept commensurate experience.\n  \n• Minimum of four years’ experience with Microsoft Windows Server and Client Operating Systems is required.\n  \n• Minimum of two years’ experience with PowerShell, DOS Batch, AutoIT, or another scripting language is preferred.\n  \n• Minimum of four years’ experience with VMware, Nutanix or another virtual server technology is preferred.\n  \n• Minimum of four years’ experience with troubleshooting and installing peripheral devices and hardware components such as RAM, CPU, motherboard, etc. is preferred.\n  \n• Minimum of two years’ experience with leading projects is preferred.\n  \n• Minimum of one year experience with Microsoft Visio is preferred.\n  \n• A fundamental understanding of Active Directory, DNS, DHCP, Databases, Virtual Servers, Patch Management and Networking Concepts is preferred.\n  \n• A fundamental understanding of Change Management practices and ITIL best practices is preferred.\n  \n• A fundamental understanding of security concepts is preferred, in particular PII, PCI, SOX, and GLBA.\n  \n• Must be willing to work a variable schedule as needed.  This may include early mornings, evenings, weekends and/or holidays.\n  \n• Must be willing to be on call to support critical systems and services.\n  \n• Must have the ability to work independently with minimal supervision.\n  \n• Must be able to work in a team-oriented environment.\n  \n• Must possess a valid driver’s license and must be willing to travel to branch locations.\n  \n• Must have the ability to be insured on the Bank’s vehicle insurance policy throughout tenure of employment.\n  \n• Must have the ability to lift 25 pounds.\n  \n\n  \nPrinciple Activities and Duties\n  \n\n  \n• Prioritize and work on IT incidents, requests and projects from conception through implementation.\n  \n• Work with team members, business unit personnel, and vendors to design systems as well as configure servers and appliances.\n  \n• Provide troubleshooting of servers, operating systems and application related issues.\n  \n• Monitor the operating systems, troubleshoot and maintain system integrity for bank systems.\n  \n• Monitor the health of systems and servers.\n  \n• Perform general system maintenance of hardware, servers, operating systems, applications, patches and vulnerability management as directed.\n  \n• Create scripts to automate system tasks and processes to improve efficiency.\n  \n• Implement system changes following change control procedures.\n  \n• Provide technical support and escalate incidents to a higher level after appropriate service level agreement.\n  \n• Provide support to level 1 systems administrators.\n  \n• Provide remote and onsite support of desktops, printers, hardware and software.\n  \n• Document systems and solutions.\n  \n• Interact and engage with other team members and business unit personnel.\n  \n• Assist in disaster recovery testing.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/D73ABB47673C4CD0B2CBEE8AA2FBF32824",
        "title": "Systems Administrator Level II",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-07-27 06:37:47"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "BDE7B9B80EB04F5A9F61F939825D3350",
        "reqid": "2600BR",
        "description": "Job Overview:\n  \n\n  \nThe AVP IT Audit assists with the development, implementation, and coordination of the annual audit plan.  The AVP IT Audit plans and supervises concurrent audits of assigned departments, focusing on auditing Dollar Bank’s IT systems / applications and as necessary outsourced systems.  In addition, the AVP IT Audit provides on-the-job training and performance feedback, as applicable, for the Staff and Senior level positions.\n  \n\n  \nQualifications:\n  \n\n  \n• A Bachelor’s degree in Information Systems or related field is required. Master’s degree strongly preferred.\n  \n•A minimum of five years of IT audit experience and/or other IT experience.\n  \n• Supervisory experience is required.\n  \n• Professional Certification is preferred (CISA, CRISC, CISSP, CISM).\n  \n• The AVP IT Audit must also possess an acceptable level of knowledge and/or skills regarding the following:\n  \nACL and TeamMate experience helpful.\n  \nUnderstanding of information technology principles and techniques.\n  \nAbility to communicate effectively; both orally and in writing.\n  \nAbility to coordinate multiple projects and delegate work and responsibility.\n  \nAbility to make sound decisions and provide leadership to the IT Audit staff.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Assist with development of audit plans for IT areas of Bank.\n  \n• Review and evaluate audit procedures and recommend upgrades.\n  \n• Consult with VP IT Audit and Chief Audit Executive regarding audit strategies.\n  \n• Organizes, plans, and conducts audits within the framework established and as assigned by the VP IT Audit and/ or Chief Audit Executive. On selected audits, the AVP IT Audit will also perform all duties associated with the in-charge auditor.\n  \n• Develops and/or approves audit work programs that support the objectives of the review and incorporates those areas of highest risk to the Bank.\n  \n• Monitors audit time and compares with the budget to ensure that audits are completed in a timely manner.\n  \n• Assists VP IT Audit with preparing time analyses for future budgets and audit plans.\n  \n• Participates in the hiring process by interviewing applicants as required.\n  \n• Assists in providing ongoing training for audit staff.\n  \n• Actively involved with computer audit support within the department, as applicable.\n  \n• Actively involved with the coordination of external audit work with the bank’s public accountants, as applicable.\n  \n• Prepares and/or assists with the completion of the annual personnel performance evaluations and the periodic internal evaluations, as applicable, for the audit staff.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/BDE7B9B80EB04F5A9F61F939825D335024",
        "title": "IT Audit Manager/AVP",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-02-05 03:34:42"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "C10B294E685A426EB45B3FAAC9F3AB35",
        "reqid": "2864BR",
        "description": "Job Overview:\n  \n\n  \nDigital is a rapidly growing and critical area at Dollar Bank.  As the AVP Digital Design you will be responsible for creating an outstanding and unique digital customer experience for our retail and business customers while coordinating consistent branding and look & feel across all digital properties.  This role plays an important and influential role for the business, working closely with product managers, communications professionals, developers and stakeholders to bring the product/service to life. We are seeking a mix of skill sets - including information architecture, wire framing, visual design, interactive design, and prototyping.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Web Design, Interaction Design, Multimedia, Visual Design, or related UX/UI field and minimum 5 years’ experience in interaction or user experience design required. Will consider commensurate experience.\n  \n• Strong portfolio of work showcasing engaging user-centered design solutions.\n  \n• Transactional site design & user experience (online, mobile app, B2C, B2B) preferred.\n  \n• Human interaction experience with digital interfaces required.\n  \n• Proven ability to create, run, and manage customer surveys, design research, and focus groups with customers/non-customers.\n  \n• Familiar with MVC, CSS, jQuery, JavaScript a plus.\n  \n• Working knowledge of CMS.\n  \n• Solid understanding of usability principles, user-centered design methods, and interaction design patterns.\n  \n• Proven ability to maximize SEO results, as well as a solid understanding of optimizing account opening and new customer onboarding via digital.\n  \n• Fluency with InDesign, Illustrator, Photoshop, and Keynote.\n  \n• Practical understanding of HTML 5, JavaScript and CSS preprocessing frameworks.\n  \n• Proven understanding of brand development and representation in the digital space.\n  \n• Ability to create detailed design specifications and mockups to communicate design intent.\n  \n• Understanding of ADA compliance and other design and technical regulations and requirements in the digital space.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Be the UX/UI expert for all digital platforms for retail and business banking.\n  \n• Delivering unique and innovative designs and experiences across multiple applications, products and payments offerings.\n  \n• Turn complex engagements into simple and engaging customer experiences for web, iPad/iPhone, and Android.\n  \n• Create HTML/Java-based wireframes, workflows, storyboards, and navigation maps that deliver a seamless user experience.\n  \n• Effectively communicate and defend design choices, advocating for the customer.\n  \n• Collaborate with digital and bank product managers and developers to understand objectives and constraints.\n  \n• Lead customer research to design and observe user studies and translate research findings into insights and design improvements.\n  \n• Be able to understand the differences and nuances inherent in the major mobile operating systems and device types – iOS, Android, smartphone, tablet.\n  \n• Be able to translate high level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\n  \n• Stay current on and be the SME for competitive UI/UX for banking as well as other digital experiences that influence digital banking customers’ expectations.\n  \n• Work with marketing to maximize SEO results, website management and utilization of bank’s graphic standards.\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  3 Gateway Center Lobby\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:15am - 4:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/C10B294E685A426EB45B3FAAC9F3AB3524",
        "title": "AVP Digital User Experience",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-08 04:09:15"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "3E02D88195D240CD8156DAD81DFFC41B",
        "reqid": "2860BR",
        "description": "Job Overview:\n  \n\n  \nResponsible for working with Information Technology and the Business Areas within Dollar Bank and making sure their needs are understood and delivered, while also ensuring that the needs align with the overall Information Technology strategy.  Develops the Business Requirements (functional and non-functional), Use Cases and required artifacts for projects from initiation through implementation and provides consistent communication with the stakeholders to make sure requirements are being delivered. Follows the adopted Change Management protocol and adheres to project management processes to ensure projects are delivered successfully.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Information Technology or related field required. Will consider commensurate experience\n  \n• Exceptional written and verbal communication that includes good listening skills and an open attitude and acceptance to coaching and being coached\n  \n• Demonstrated experience working on projects\n  \n• Strong organizational and analytical skills\n  \n• Demonstrated organization and team building skills\n  \n• Excellent teamwork and collaboration skills\n  \n• Demonstrated leadership skills\n  \n• Knowledge of Microsoft Office Tools\n  \n• Able to manage simultaneous projects\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Interview Subject Matter Experts to extract the business case for a project and potential impacts\n  \n• Utilize both waterfall and agile development methodologies\n  \n• Facilitate stakeholders on process, strategy, and investments to achieve the enterprise business and IT strategy\n  \n• Negotiate scopes/requirements documentation with stakeholders\n  \n• Aligns with the internal Business Groups to determine their needs, develops business requirements and manage their expectations throughout the project lifecycle\n  \n• Coordinates and facilitates project requirement meetings\n  \n• Maintains communication with all project stakeholders\n  \n• Addresses problems through risk management and contingency planning and presents solutions and/or options to the Project Manager and executive management\n  \n• Monitors effectiveness of project management processes and methodologies; recommends improvements as necessary\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:00am - 4:15pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/3E02D88195D240CD8156DAD81DFFC41B24",
        "title": "IT Requirements Analyst I",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-03 03:34:57"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "D73ABB47673C4CD0B2CBEE8AA2FBF328",
        "reqid": "2845BR",
        "description": "Job Overview\n  \n\n  \nThis position is responsible for providing system health monitoring, troubleshooting, system maintenance and server support for the Distributed Services Infrastructure Support Department. The Department is responsible for the management of over 600 servers, both physical and virtual, over 100 Microsoft SQL Databases, over 150 business applications and over 80 branches throughout the Eastern United States.\n  \n\n  \nQualifications\n  \n\n  \n• Bachelor’s Degree in Computer Science, Information Systems or another related field is required.  Will accept commensurate experience.\n  \n• Minimum of four years’ experience with Microsoft Windows Server and Client Operating Systems is required.\n  \n• Minimum of two years’ experience with PowerShell, DOS Batch, AutoIT, or another scripting language is preferred.\n  \n• Minimum of four years’ experience with VMware, Nutanix or another virtual server technology is preferred.\n  \n• Minimum of four years’ experience with troubleshooting and installing peripheral devices and hardware components such as RAM, CPU, motherboard, etc. is preferred.\n  \n• Minimum of two years’ experience with leading projects is preferred.\n  \n• Minimum of one year experience with Microsoft Visio is preferred.\n  \n• A fundamental understanding of Active Directory, DNS, DHCP, Databases, Virtual Servers, Patch Management and Networking Concepts is preferred.\n  \n• A fundamental understanding of Change Management practices and ITIL best practices is preferred.\n  \n• A fundamental understanding of security concepts is preferred, in particular PII, PCI, SOX, and GLBA.\n  \n• Must be willing to work a variable schedule as needed.  This may include early mornings, evenings, weekends and/or holidays.\n  \n• Must be willing to be on call to support critical systems and services.\n  \n• Must have the ability to work independently with minimal supervision.\n  \n• Must be able to work in a team-oriented environment.\n  \n• Must possess a valid driver’s license and must be willing to travel to branch locations.\n  \n• Must have the ability to be insured on the Bank’s vehicle insurance policy throughout tenure of employment.\n  \n• Must have the ability to lift 25 pounds.\n  \n\n  \nPrinciple Activities and Duties\n  \n\n  \n• Prioritize and work on IT incidents, requests and projects from conception through implementation.\n  \n• Work with team members, business unit personnel, and vendors to design systems as well as configure servers and appliances.\n  \n• Provide troubleshooting of servers, operating systems and application related issues.\n  \n• Monitor the operating systems, troubleshoot and maintain system integrity for bank systems.\n  \n• Monitor the health of systems and servers.\n  \n• Perform general system maintenance of hardware, servers, operating systems, applications, patches and vulnerability management as directed.\n  \n• Create scripts to automate system tasks and processes to improve efficiency.\n  \n• Implement system changes following change control procedures.\n  \n• Provide technical support and escalate incidents to a higher level after appropriate service level agreement.\n  \n• Provide support to level 1 systems administrators.\n  \n• Provide remote and onsite support of desktops, printers, hardware and software.\n  \n• Document systems and solutions.\n  \n• Interact and engage with other team members and business unit personnel.\n  \n• Assist in disaster recovery testing.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/D73ABB47673C4CD0B2CBEE8AA2FBF32824",
        "title": "Systems Administrator Level II",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-07-27 06:37:47"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "BDE7B9B80EB04F5A9F61F939825D3350",
        "reqid": "2600BR",
        "description": "Job Overview:\n  \n\n  \nThe AVP IT Audit assists with the development, implementation, and coordination of the annual audit plan.  The AVP IT Audit plans and supervises concurrent audits of assigned departments, focusing on auditing Dollar Bank’s IT systems / applications and as necessary outsourced systems.  In addition, the AVP IT Audit provides on-the-job training and performance feedback, as applicable, for the Staff and Senior level positions.\n  \n\n  \nQualifications:\n  \n\n  \n• A Bachelor’s degree in Information Systems or related field is required. Master’s degree strongly preferred.\n  \n•A minimum of five years of IT audit experience and/or other IT experience.\n  \n• Supervisory experience is required.\n  \n• Professional Certification is preferred (CISA, CRISC, CISSP, CISM).\n  \n• The AVP IT Audit must also possess an acceptable level of knowledge and/or skills regarding the following:\n  \nACL and TeamMate experience helpful.\n  \nUnderstanding of information technology principles and techniques.\n  \nAbility to communicate effectively; both orally and in writing.\n  \nAbility to coordinate multiple projects and delegate work and responsibility.\n  \nAbility to make sound decisions and provide leadership to the IT Audit staff.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Assist with development of audit plans for IT areas of Bank.\n  \n• Review and evaluate audit procedures and recommend upgrades.\n  \n• Consult with VP IT Audit and Chief Audit Executive regarding audit strategies.\n  \n• Organizes, plans, and conducts audits within the framework established and as assigned by the VP IT Audit and/ or Chief Audit Executive. On selected audits, the AVP IT Audit will also perform all duties associated with the in-charge auditor.\n  \n• Develops and/or approves audit work programs that support the objectives of the review and incorporates those areas of highest risk to the Bank.\n  \n• Monitors audit time and compares with the budget to ensure that audits are completed in a timely manner.\n  \n• Assists VP IT Audit with preparing time analyses for future budgets and audit plans.\n  \n• Participates in the hiring process by interviewing applicants as required.\n  \n• Assists in providing ongoing training for audit staff.\n  \n• Actively involved with computer audit support within the department, as applicable.\n  \n• Actively involved with the coordination of external audit work with the bank’s public accountants, as applicable.\n  \n• Prepares and/or assists with the completion of the annual personnel performance evaluations and the periodic internal evaluations, as applicable, for the audit staff.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/BDE7B9B80EB04F5A9F61F939825D335024",
        "title": "IT Audit Manager/AVP",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-02-05 03:34:42"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "C10B294E685A426EB45B3FAAC9F3AB35",
        "reqid": "2864BR",
        "description": "Job Overview:\n  \n\n  \nDigital is a rapidly growing and critical area at Dollar Bank.  As the AVP Digital Design you will be responsible for creating an outstanding and unique digital customer experience for our retail and business customers while coordinating consistent branding and look & feel across all digital properties.  This role plays an important and influential role for the business, working closely with product managers, communications professionals, developers and stakeholders to bring the product/service to life. We are seeking a mix of skill sets - including information architecture, wire framing, visual design, interactive design, and prototyping.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Web Design, Interaction Design, Multimedia, Visual Design, or related UX/UI field and minimum 5 years’ experience in interaction or user experience design required. Will consider commensurate experience.\n  \n• Strong portfolio of work showcasing engaging user-centered design solutions.\n  \n• Transactional site design & user experience (online, mobile app, B2C, B2B) preferred.\n  \n• Human interaction experience with digital interfaces required.\n  \n• Proven ability to create, run, and manage customer surveys, design research, and focus groups with customers/non-customers.\n  \n• Familiar with MVC, CSS, jQuery, JavaScript a plus.\n  \n• Working knowledge of CMS.\n  \n• Solid understanding of usability principles, user-centered design methods, and interaction design patterns.\n  \n• Proven ability to maximize SEO results, as well as a solid understanding of optimizing account opening and new customer onboarding via digital.\n  \n• Fluency with InDesign, Illustrator, Photoshop, and Keynote.\n  \n• Practical understanding of HTML 5, JavaScript and CSS preprocessing frameworks.\n  \n• Proven understanding of brand development and representation in the digital space.\n  \n• Ability to create detailed design specifications and mockups to communicate design intent.\n  \n• Understanding of ADA compliance and other design and technical regulations and requirements in the digital space.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Be the UX/UI expert for all digital platforms for retail and business banking.\n  \n• Delivering unique and innovative designs and experiences across multiple applications, products and payments offerings.\n  \n• Turn complex engagements into simple and engaging customer experiences for web, iPad/iPhone, and Android.\n  \n• Create HTML/Java-based wireframes, workflows, storyboards, and navigation maps that deliver a seamless user experience.\n  \n• Effectively communicate and defend design choices, advocating for the customer.\n  \n• Collaborate with digital and bank product managers and developers to understand objectives and constraints.\n  \n• Lead customer research to design and observe user studies and translate research findings into insights and design improvements.\n  \n• Be able to understand the differences and nuances inherent in the major mobile operating systems and device types – iOS, Android, smartphone, tablet.\n  \n• Be able to translate high level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\n  \n• Stay current on and be the SME for competitive UI/UX for banking as well as other digital experiences that influence digital banking customers’ expectations.\n  \n• Work with marketing to maximize SEO results, website management and utilization of bank’s graphic standards.\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  3 Gateway Center Lobby\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:15am - 4:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/C10B294E685A426EB45B3FAAC9F3AB3524",
        "title": "AVP Digital User Experience",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-08 04:09:15"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "3E02D88195D240CD8156DAD81DFFC41B",
        "reqid": "2860BR",
        "description": "Job Overview:\n  \n\n  \nResponsible for working with Information Technology and the Business Areas within Dollar Bank and making sure their needs are understood and delivered, while also ensuring that the needs align with the overall Information Technology strategy.  Develops the Business Requirements (functional and non-functional), Use Cases and required artifacts for projects from initiation through implementation and provides consistent communication with the stakeholders to make sure requirements are being delivered. Follows the adopted Change Management protocol and adheres to project management processes to ensure projects are delivered successfully.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Information Technology or related field required. Will consider commensurate experience\n  \n• Exceptional written and verbal communication that includes good listening skills and an open attitude and acceptance to coaching and being coached\n  \n• Demonstrated experience working on projects\n  \n• Strong organizational and analytical skills\n  \n• Demonstrated organization and team building skills\n  \n• Excellent teamwork and collaboration skills\n  \n• Demonstrated leadership skills\n  \n• Knowledge of Microsoft Office Tools\n  \n• Able to manage simultaneous projects\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Interview Subject Matter Experts to extract the business case for a project and potential impacts\n  \n• Utilize both waterfall and agile development methodologies\n  \n• Facilitate stakeholders on process, strategy, and investments to achieve the enterprise business and IT strategy\n  \n• Negotiate scopes/requirements documentation with stakeholders\n  \n• Aligns with the internal Business Groups to determine their needs, develops business requirements and manage their expectations throughout the project lifecycle\n  \n• Coordinates and facilitates project requirement meetings\n  \n• Maintains communication with all project stakeholders\n  \n• Addresses problems through risk management and contingency planning and presents solutions and/or options to the Project Manager and executive management\n  \n• Monitors effectiveness of project management processes and methodologies; recommends improvements as necessary\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:00am - 4:15pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/3E02D88195D240CD8156DAD81DFFC41B24",
        "title": "IT Requirements Analyst I",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-03 03:34:57"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "D73ABB47673C4CD0B2CBEE8AA2FBF328",
        "reqid": "2845BR",
        "description": "Job Overview\n  \n\n  \nThis position is responsible for providing system health monitoring, troubleshooting, system maintenance and server support for the Distributed Services Infrastructure Support Department. The Department is responsible for the management of over 600 servers, both physical and virtual, over 100 Microsoft SQL Databases, over 150 business applications and over 80 branches throughout the Eastern United States.\n  \n\n  \nQualifications\n  \n\n  \n• Bachelor’s Degree in Computer Science, Information Systems or another related field is required.  Will accept commensurate experience.\n  \n• Minimum of four years’ experience with Microsoft Windows Server and Client Operating Systems is required.\n  \n• Minimum of two years’ experience with PowerShell, DOS Batch, AutoIT, or another scripting language is preferred.\n  \n• Minimum of four years’ experience with VMware, Nutanix or another virtual server technology is preferred.\n  \n• Minimum of four years’ experience with troubleshooting and installing peripheral devices and hardware components such as RAM, CPU, motherboard, etc. is preferred.\n  \n• Minimum of two years’ experience with leading projects is preferred.\n  \n• Minimum of one year experience with Microsoft Visio is preferred.\n  \n• A fundamental understanding of Active Directory, DNS, DHCP, Databases, Virtual Servers, Patch Management and Networking Concepts is preferred.\n  \n• A fundamental understanding of Change Management practices and ITIL best practices is preferred.\n  \n• A fundamental understanding of security concepts is preferred, in particular PII, PCI, SOX, and GLBA.\n  \n• Must be willing to work a variable schedule as needed.  This may include early mornings, evenings, weekends and/or holidays.\n  \n• Must be willing to be on call to support critical systems and services.\n  \n• Must have the ability to work independently with minimal supervision.\n  \n• Must be able to work in a team-oriented environment.\n  \n• Must possess a valid driver’s license and must be willing to travel to branch locations.\n  \n• Must have the ability to be insured on the Bank’s vehicle insurance policy throughout tenure of employment.\n  \n• Must have the ability to lift 25 pounds.\n  \n\n  \nPrinciple Activities and Duties\n  \n\n  \n• Prioritize and work on IT incidents, requests and projects from conception through implementation.\n  \n• Work with team members, business unit personnel, and vendors to design systems as well as configure servers and appliances.\n  \n• Provide troubleshooting of servers, operating systems and application related issues.\n  \n• Monitor the operating systems, troubleshoot and maintain system integrity for bank systems.\n  \n• Monitor the health of systems and servers.\n  \n• Perform general system maintenance of hardware, servers, operating systems, applications, patches and vulnerability management as directed.\n  \n• Create scripts to automate system tasks and processes to improve efficiency.\n  \n• Implement system changes following change control procedures.\n  \n• Provide technical support and escalate incidents to a higher level after appropriate service level agreement.\n  \n• Provide support to level 1 systems administrators.\n  \n• Provide remote and onsite support of desktops, printers, hardware and software.\n  \n• Document systems and solutions.\n  \n• Interact and engage with other team members and business unit personnel.\n  \n• Assist in disaster recovery testing.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/D73ABB47673C4CD0B2CBEE8AA2FBF32824",
        "title": "Systems Administrator Level II",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-07-27 06:37:47"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "BDE7B9B80EB04F5A9F61F939825D3350",
        "reqid": "2600BR",
        "description": "Job Overview:\n  \n\n  \nThe AVP IT Audit assists with the development, implementation, and coordination of the annual audit plan.  The AVP IT Audit plans and supervises concurrent audits of assigned departments, focusing on auditing Dollar Bank’s IT systems / applications and as necessary outsourced systems.  In addition, the AVP IT Audit provides on-the-job training and performance feedback, as applicable, for the Staff and Senior level positions.\n  \n\n  \nQualifications:\n  \n\n  \n• A Bachelor’s degree in Information Systems or related field is required. Master’s degree strongly preferred.\n  \n•A minimum of five years of IT audit experience and/or other IT experience.\n  \n• Supervisory experience is required.\n  \n• Professional Certification is preferred (CISA, CRISC, CISSP, CISM).\n  \n• The AVP IT Audit must also possess an acceptable level of knowledge and/or skills regarding the following:\n  \nACL and TeamMate experience helpful.\n  \nUnderstanding of information technology principles and techniques.\n  \nAbility to communicate effectively; both orally and in writing.\n  \nAbility to coordinate multiple projects and delegate work and responsibility.\n  \nAbility to make sound decisions and provide leadership to the IT Audit staff.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Assist with development of audit plans for IT areas of Bank.\n  \n• Review and evaluate audit procedures and recommend upgrades.\n  \n• Consult with VP IT Audit and Chief Audit Executive regarding audit strategies.\n  \n• Organizes, plans, and conducts audits within the framework established and as assigned by the VP IT Audit and/ or Chief Audit Executive. On selected audits, the AVP IT Audit will also perform all duties associated with the in-charge auditor.\n  \n• Develops and/or approves audit work programs that support the objectives of the review and incorporates those areas of highest risk to the Bank.\n  \n• Monitors audit time and compares with the budget to ensure that audits are completed in a timely manner.\n  \n• Assists VP IT Audit with preparing time analyses for future budgets and audit plans.\n  \n• Participates in the hiring process by interviewing applicants as required.\n  \n• Assists in providing ongoing training for audit staff.\n  \n• Actively involved with computer audit support within the department, as applicable.\n  \n• Actively involved with the coordination of external audit work with the bank’s public accountants, as applicable.\n  \n• Prepares and/or assists with the completion of the annual personnel performance evaluations and the periodic internal evaluations, as applicable, for the audit staff.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/BDE7B9B80EB04F5A9F61F939825D335024",
        "title": "IT Audit Manager/AVP",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-02-05 03:34:42"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "C10B294E685A426EB45B3FAAC9F3AB35",
        "reqid": "2864BR",
        "description": "Job Overview:\n  \n\n  \nDigital is a rapidly growing and critical area at Dollar Bank.  As the AVP Digital Design you will be responsible for creating an outstanding and unique digital customer experience for our retail and business customers while coordinating consistent branding and look & feel across all digital properties.  This role plays an important and influential role for the business, working closely with product managers, communications professionals, developers and stakeholders to bring the product/service to life. We are seeking a mix of skill sets - including information architecture, wire framing, visual design, interactive design, and prototyping.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Web Design, Interaction Design, Multimedia, Visual Design, or related UX/UI field and minimum 5 years’ experience in interaction or user experience design required. Will consider commensurate experience.\n  \n• Strong portfolio of work showcasing engaging user-centered design solutions.\n  \n• Transactional site design & user experience (online, mobile app, B2C, B2B) preferred.\n  \n• Human interaction experience with digital interfaces required.\n  \n• Proven ability to create, run, and manage customer surveys, design research, and focus groups with customers/non-customers.\n  \n• Familiar with MVC, CSS, jQuery, JavaScript a plus.\n  \n• Working knowledge of CMS.\n  \n• Solid understanding of usability principles, user-centered design methods, and interaction design patterns.\n  \n• Proven ability to maximize SEO results, as well as a solid understanding of optimizing account opening and new customer onboarding via digital.\n  \n• Fluency with InDesign, Illustrator, Photoshop, and Keynote.\n  \n• Practical understanding of HTML 5, JavaScript and CSS preprocessing frameworks.\n  \n• Proven understanding of brand development and representation in the digital space.\n  \n• Ability to create detailed design specifications and mockups to communicate design intent.\n  \n• Understanding of ADA compliance and other design and technical regulations and requirements in the digital space.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Be the UX/UI expert for all digital platforms for retail and business banking.\n  \n• Delivering unique and innovative designs and experiences across multiple applications, products and payments offerings.\n  \n• Turn complex engagements into simple and engaging customer experiences for web, iPad/iPhone, and Android.\n  \n• Create HTML/Java-based wireframes, workflows, storyboards, and navigation maps that deliver a seamless user experience.\n  \n• Effectively communicate and defend design choices, advocating for the customer.\n  \n• Collaborate with digital and bank product managers and developers to understand objectives and constraints.\n  \n• Lead customer research to design and observe user studies and translate research findings into insights and design improvements.\n  \n• Be able to understand the differences and nuances inherent in the major mobile operating systems and device types – iOS, Android, smartphone, tablet.\n  \n• Be able to translate high level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\n  \n• Stay current on and be the SME for competitive UI/UX for banking as well as other digital experiences that influence digital banking customers’ expectations.\n  \n• Work with marketing to maximize SEO results, website management and utilization of bank’s graphic standards.\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  3 Gateway Center Lobby\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:15am - 4:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/C10B294E685A426EB45B3FAAC9F3AB3524",
        "title": "AVP Digital User Experience",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-08 04:09:15"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "3E02D88195D240CD8156DAD81DFFC41B",
        "reqid": "2860BR",
        "description": "Job Overview:\n  \n\n  \nResponsible for working with Information Technology and the Business Areas within Dollar Bank and making sure their needs are understood and delivered, while also ensuring that the needs align with the overall Information Technology strategy.  Develops the Business Requirements (functional and non-functional), Use Cases and required artifacts for projects from initiation through implementation and provides consistent communication with the stakeholders to make sure requirements are being delivered. Follows the adopted Change Management protocol and adheres to project management processes to ensure projects are delivered successfully.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Information Technology or related field required. Will consider commensurate experience\n  \n• Exceptional written and verbal communication that includes good listening skills and an open attitude and acceptance to coaching and being coached\n  \n• Demonstrated experience working on projects\n  \n• Strong organizational and analytical skills\n  \n• Demonstrated organization and team building skills\n  \n• Excellent teamwork and collaboration skills\n  \n• Demonstrated leadership skills\n  \n• Knowledge of Microsoft Office Tools\n  \n• Able to manage simultaneous projects\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Interview Subject Matter Experts to extract the business case for a project and potential impacts\n  \n• Utilize both waterfall and agile development methodologies\n  \n• Facilitate stakeholders on process, strategy, and investments to achieve the enterprise business and IT strategy\n  \n• Negotiate scopes/requirements documentation with stakeholders\n  \n• Aligns with the internal Business Groups to determine their needs, develops business requirements and manage their expectations throughout the project lifecycle\n  \n• Coordinates and facilitates project requirement meetings\n  \n• Maintains communication with all project stakeholders\n  \n• Addresses problems through risk management and contingency planning and presents solutions and/or options to the Project Manager and executive management\n  \n• Monitors effectiveness of project management processes and methodologies; recommends improvements as necessary\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:00am - 4:15pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/3E02D88195D240CD8156DAD81DFFC41B24",
        "title": "IT Requirements Analyst I",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-03 03:34:57"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "D73ABB47673C4CD0B2CBEE8AA2FBF328",
        "reqid": "2845BR",
        "description": "Job Overview\n  \n\n  \nThis position is responsible for providing system health monitoring, troubleshooting, system maintenance and server support for the Distributed Services Infrastructure Support Department. The Department is responsible for the management of over 600 servers, both physical and virtual, over 100 Microsoft SQL Databases, over 150 business applications and over 80 branches throughout the Eastern United States.\n  \n\n  \nQualifications\n  \n\n  \n• Bachelor’s Degree in Computer Science, Information Systems or another related field is required.  Will accept commensurate experience.\n  \n• Minimum of four years’ experience with Microsoft Windows Server and Client Operating Systems is required.\n  \n• Minimum of two years’ experience with PowerShell, DOS Batch, AutoIT, or another scripting language is preferred.\n  \n• Minimum of four years’ experience with VMware, Nutanix or another virtual server technology is preferred.\n  \n• Minimum of four years’ experience with troubleshooting and installing peripheral devices and hardware components such as RAM, CPU, motherboard, etc. is preferred.\n  \n• Minimum of two years’ experience with leading projects is preferred.\n  \n• Minimum of one year experience with Microsoft Visio is preferred.\n  \n• A fundamental understanding of Active Directory, DNS, DHCP, Databases, Virtual Servers, Patch Management and Networking Concepts is preferred.\n  \n• A fundamental understanding of Change Management practices and ITIL best practices is preferred.\n  \n• A fundamental understanding of security concepts is preferred, in particular PII, PCI, SOX, and GLBA.\n  \n• Must be willing to work a variable schedule as needed.  This may include early mornings, evenings, weekends and/or holidays.\n  \n• Must be willing to be on call to support critical systems and services.\n  \n• Must have the ability to work independently with minimal supervision.\n  \n• Must be able to work in a team-oriented environment.\n  \n• Must possess a valid driver’s license and must be willing to travel to branch locations.\n  \n• Must have the ability to be insured on the Bank’s vehicle insurance policy throughout tenure of employment.\n  \n• Must have the ability to lift 25 pounds.\n  \n\n  \nPrinciple Activities and Duties\n  \n\n  \n• Prioritize and work on IT incidents, requests and projects from conception through implementation.\n  \n• Work with team members, business unit personnel, and vendors to design systems as well as configure servers and appliances.\n  \n• Provide troubleshooting of servers, operating systems and application related issues.\n  \n• Monitor the operating systems, troubleshoot and maintain system integrity for bank systems.\n  \n• Monitor the health of systems and servers.\n  \n• Perform general system maintenance of hardware, servers, operating systems, applications, patches and vulnerability management as directed.\n  \n• Create scripts to automate system tasks and processes to improve efficiency.\n  \n• Implement system changes following change control procedures.\n  \n• Provide technical support and escalate incidents to a higher level after appropriate service level agreement.\n  \n• Provide support to level 1 systems administrators.\n  \n• Provide remote and onsite support of desktops, printers, hardware and software.\n  \n• Document systems and solutions.\n  \n• Interact and engage with other team members and business unit personnel.\n  \n• Assist in disaster recovery testing.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/D73ABB47673C4CD0B2CBEE8AA2FBF32824",
        "title": "Systems Administrator Level II",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-07-27 06:37:47"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "BDE7B9B80EB04F5A9F61F939825D3350",
        "reqid": "2600BR",
        "description": "Job Overview:\n  \n\n  \nThe AVP IT Audit assists with the development, implementation, and coordination of the annual audit plan.  The AVP IT Audit plans and supervises concurrent audits of assigned departments, focusing on auditing Dollar Bank’s IT systems / applications and as necessary outsourced systems.  In addition, the AVP IT Audit provides on-the-job training and performance feedback, as applicable, for the Staff and Senior level positions.\n  \n\n  \nQualifications:\n  \n\n  \n• A Bachelor’s degree in Information Systems or related field is required. Master’s degree strongly preferred.\n  \n•A minimum of five years of IT audit experience and/or other IT experience.\n  \n• Supervisory experience is required.\n  \n• Professional Certification is preferred (CISA, CRISC, CISSP, CISM).\n  \n• The AVP IT Audit must also possess an acceptable level of knowledge and/or skills regarding the following:\n  \nACL and TeamMate experience helpful.\n  \nUnderstanding of information technology principles and techniques.\n  \nAbility to communicate effectively; both orally and in writing.\n  \nAbility to coordinate multiple projects and delegate work and responsibility.\n  \nAbility to make sound decisions and provide leadership to the IT Audit staff.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Assist with development of audit plans for IT areas of Bank.\n  \n• Review and evaluate audit procedures and recommend upgrades.\n  \n• Consult with VP IT Audit and Chief Audit Executive regarding audit strategies.\n  \n• Organizes, plans, and conducts audits within the framework established and as assigned by the VP IT Audit and/ or Chief Audit Executive. On selected audits, the AVP IT Audit will also perform all duties associated with the in-charge auditor.\n  \n• Develops and/or approves audit work programs that support the objectives of the review and incorporates those areas of highest risk to the Bank.\n  \n• Monitors audit time and compares with the budget to ensure that audits are completed in a timely manner.\n  \n• Assists VP IT Audit with preparing time analyses for future budgets and audit plans.\n  \n• Participates in the hiring process by interviewing applicants as required.\n  \n• Assists in providing ongoing training for audit staff.\n  \n• Actively involved with computer audit support within the department, as applicable.\n  \n• Actively involved with the coordination of external audit work with the bank’s public accountants, as applicable.\n  \n• Prepares and/or assists with the completion of the annual personnel performance evaluations and the periodic internal evaluations, as applicable, for the audit staff.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/BDE7B9B80EB04F5A9F61F939825D335024",
        "title": "IT Audit Manager/AVP",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-02-05 03:34:42"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "C10B294E685A426EB45B3FAAC9F3AB35",
        "reqid": "2864BR",
        "description": "Job Overview:\n  \n\n  \nDigital is a rapidly growing and critical area at Dollar Bank.  As the AVP Digital Design you will be responsible for creating an outstanding and unique digital customer experience for our retail and business customers while coordinating consistent branding and look & feel across all digital properties.  This role plays an important and influential role for the business, working closely with product managers, communications professionals, developers and stakeholders to bring the product/service to life. We are seeking a mix of skill sets - including information architecture, wire framing, visual design, interactive design, and prototyping.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Web Design, Interaction Design, Multimedia, Visual Design, or related UX/UI field and minimum 5 years’ experience in interaction or user experience design required. Will consider commensurate experience.\n  \n• Strong portfolio of work showcasing engaging user-centered design solutions.\n  \n• Transactional site design & user experience (online, mobile app, B2C, B2B) preferred.\n  \n• Human interaction experience with digital interfaces required.\n  \n• Proven ability to create, run, and manage customer surveys, design research, and focus groups with customers/non-customers.\n  \n• Familiar with MVC, CSS, jQuery, JavaScript a plus.\n  \n• Working knowledge of CMS.\n  \n• Solid understanding of usability principles, user-centered design methods, and interaction design patterns.\n  \n• Proven ability to maximize SEO results, as well as a solid understanding of optimizing account opening and new customer onboarding via digital.\n  \n• Fluency with InDesign, Illustrator, Photoshop, and Keynote.\n  \n• Practical understanding of HTML 5, JavaScript and CSS preprocessing frameworks.\n  \n• Proven understanding of brand development and representation in the digital space.\n  \n• Ability to create detailed design specifications and mockups to communicate design intent.\n  \n• Understanding of ADA compliance and other design and technical regulations and requirements in the digital space.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Be the UX/UI expert for all digital platforms for retail and business banking.\n  \n• Delivering unique and innovative designs and experiences across multiple applications, products and payments offerings.\n  \n• Turn complex engagements into simple and engaging customer experiences for web, iPad/iPhone, and Android.\n  \n• Create HTML/Java-based wireframes, workflows, storyboards, and navigation maps that deliver a seamless user experience.\n  \n• Effectively communicate and defend design choices, advocating for the customer.\n  \n• Collaborate with digital and bank product managers and developers to understand objectives and constraints.\n  \n• Lead customer research to design and observe user studies and translate research findings into insights and design improvements.\n  \n• Be able to understand the differences and nuances inherent in the major mobile operating systems and device types – iOS, Android, smartphone, tablet.\n  \n• Be able to translate high level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\n  \n• Stay current on and be the SME for competitive UI/UX for banking as well as other digital experiences that influence digital banking customers’ expectations.\n  \n• Work with marketing to maximize SEO results, website management and utilization of bank’s graphic standards.\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  3 Gateway Center Lobby\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:15am - 4:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/C10B294E685A426EB45B3FAAC9F3AB3524",
        "title": "AVP Digital User Experience",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-08 04:09:15"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "3E02D88195D240CD8156DAD81DFFC41B",
        "reqid": "2860BR",
        "description": "Job Overview:\n  \n\n  \nResponsible for working with Information Technology and the Business Areas within Dollar Bank and making sure their needs are understood and delivered, while also ensuring that the needs align with the overall Information Technology strategy.  Develops the Business Requirements (functional and non-functional), Use Cases and required artifacts for projects from initiation through implementation and provides consistent communication with the stakeholders to make sure requirements are being delivered. Follows the adopted Change Management protocol and adheres to project management processes to ensure projects are delivered successfully.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Information Technology or related field required. Will consider commensurate experience\n  \n• Exceptional written and verbal communication that includes good listening skills and an open attitude and acceptance to coaching and being coached\n  \n• Demonstrated experience working on projects\n  \n• Strong organizational and analytical skills\n  \n• Demonstrated organization and team building skills\n  \n• Excellent teamwork and collaboration skills\n  \n• Demonstrated leadership skills\n  \n• Knowledge of Microsoft Office Tools\n  \n• Able to manage simultaneous projects\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Interview Subject Matter Experts to extract the business case for a project and potential impacts\n  \n• Utilize both waterfall and agile development methodologies\n  \n• Facilitate stakeholders on process, strategy, and investments to achieve the enterprise business and IT strategy\n  \n• Negotiate scopes/requirements documentation with stakeholders\n  \n• Aligns with the internal Business Groups to determine their needs, develops business requirements and manage their expectations throughout the project lifecycle\n  \n• Coordinates and facilitates project requirement meetings\n  \n• Maintains communication with all project stakeholders\n  \n• Addresses problems through risk management and contingency planning and presents solutions and/or options to the Project Manager and executive management\n  \n• Monitors effectiveness of project management processes and methodologies; recommends improvements as necessary\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:00am - 4:15pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/3E02D88195D240CD8156DAD81DFFC41B24",
        "title": "IT Requirements Analyst I",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-03 03:34:57"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "D73ABB47673C4CD0B2CBEE8AA2FBF328",
        "reqid": "2845BR",
        "description": "Job Overview\n  \n\n  \nThis position is responsible for providing system health monitoring, troubleshooting, system maintenance and server support for the Distributed Services Infrastructure Support Department. The Department is responsible for the management of over 600 servers, both physical and virtual, over 100 Microsoft SQL Databases, over 150 business applications and over 80 branches throughout the Eastern United States.\n  \n\n  \nQualifications\n  \n\n  \n• Bachelor’s Degree in Computer Science, Information Systems or another related field is required.  Will accept commensurate experience.\n  \n• Minimum of four years’ experience with Microsoft Windows Server and Client Operating Systems is required.\n  \n• Minimum of two years’ experience with PowerShell, DOS Batch, AutoIT, or another scripting language is preferred.\n  \n• Minimum of four years’ experience with VMware, Nutanix or another virtual server technology is preferred.\n  \n• Minimum of four years’ experience with troubleshooting and installing peripheral devices and hardware components such as RAM, CPU, motherboard, etc. is preferred.\n  \n• Minimum of two years’ experience with leading projects is preferred.\n  \n• Minimum of one year experience with Microsoft Visio is preferred.\n  \n• A fundamental understanding of Active Directory, DNS, DHCP, Databases, Virtual Servers, Patch Management and Networking Concepts is preferred.\n  \n• A fundamental understanding of Change Management practices and ITIL best practices is preferred.\n  \n• A fundamental understanding of security concepts is preferred, in particular PII, PCI, SOX, and GLBA.\n  \n• Must be willing to work a variable schedule as needed.  This may include early mornings, evenings, weekends and/or holidays.\n  \n• Must be willing to be on call to support critical systems and services.\n  \n• Must have the ability to work independently with minimal supervision.\n  \n• Must be able to work in a team-oriented environment.\n  \n• Must possess a valid driver’s license and must be willing to travel to branch locations.\n  \n• Must have the ability to be insured on the Bank’s vehicle insurance policy throughout tenure of employment.\n  \n• Must have the ability to lift 25 pounds.\n  \n\n  \nPrinciple Activities and Duties\n  \n\n  \n• Prioritize and work on IT incidents, requests and projects from conception through implementation.\n  \n• Work with team members, business unit personnel, and vendors to design systems as well as configure servers and appliances.\n  \n• Provide troubleshooting of servers, operating systems and application related issues.\n  \n• Monitor the operating systems, troubleshoot and maintain system integrity for bank systems.\n  \n• Monitor the health of systems and servers.\n  \n• Perform general system maintenance of hardware, servers, operating systems, applications, patches and vulnerability management as directed.\n  \n• Create scripts to automate system tasks and processes to improve efficiency.\n  \n• Implement system changes following change control procedures.\n  \n• Provide technical support and escalate incidents to a higher level after appropriate service level agreement.\n  \n• Provide support to level 1 systems administrators.\n  \n• Provide remote and onsite support of desktops, printers, hardware and software.\n  \n• Document systems and solutions.\n  \n• Interact and engage with other team members and business unit personnel.\n  \n• Assist in disaster recovery testing.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/D73ABB47673C4CD0B2CBEE8AA2FBF32824",
        "title": "Systems Administrator Level II",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-07-27 06:37:47"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "BDE7B9B80EB04F5A9F61F939825D3350",
        "reqid": "2600BR",
        "description": "Job Overview:\n  \n\n  \nThe AVP IT Audit assists with the development, implementation, and coordination of the annual audit plan.  The AVP IT Audit plans and supervises concurrent audits of assigned departments, focusing on auditing Dollar Bank’s IT systems / applications and as necessary outsourced systems.  In addition, the AVP IT Audit provides on-the-job training and performance feedback, as applicable, for the Staff and Senior level positions.\n  \n\n  \nQualifications:\n  \n\n  \n• A Bachelor’s degree in Information Systems or related field is required. Master’s degree strongly preferred.\n  \n•A minimum of five years of IT audit experience and/or other IT experience.\n  \n• Supervisory experience is required.\n  \n• Professional Certification is preferred (CISA, CRISC, CISSP, CISM).\n  \n• The AVP IT Audit must also possess an acceptable level of knowledge and/or skills regarding the following:\n  \nACL and TeamMate experience helpful.\n  \nUnderstanding of information technology principles and techniques.\n  \nAbility to communicate effectively; both orally and in writing.\n  \nAbility to coordinate multiple projects and delegate work and responsibility.\n  \nAbility to make sound decisions and provide leadership to the IT Audit staff.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Assist with development of audit plans for IT areas of Bank.\n  \n• Review and evaluate audit procedures and recommend upgrades.\n  \n• Consult with VP IT Audit and Chief Audit Executive regarding audit strategies.\n  \n• Organizes, plans, and conducts audits within the framework established and as assigned by the VP IT Audit and/ or Chief Audit Executive. On selected audits, the AVP IT Audit will also perform all duties associated with the in-charge auditor.\n  \n• Develops and/or approves audit work programs that support the objectives of the review and incorporates those areas of highest risk to the Bank.\n  \n• Monitors audit time and compares with the budget to ensure that audits are completed in a timely manner.\n  \n• Assists VP IT Audit with preparing time analyses for future budgets and audit plans.\n  \n• Participates in the hiring process by interviewing applicants as required.\n  \n• Assists in providing ongoing training for audit staff.\n  \n• Actively involved with computer audit support within the department, as applicable.\n  \n• Actively involved with the coordination of external audit work with the bank’s public accountants, as applicable.\n  \n• Prepares and/or assists with the completion of the annual personnel performance evaluations and the periodic internal evaluations, as applicable, for the audit staff.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/BDE7B9B80EB04F5A9F61F939825D335024",
        "title": "IT Audit Manager/AVP",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-02-05 03:34:42"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "C10B294E685A426EB45B3FAAC9F3AB35",
        "reqid": "2864BR",
        "description": "Job Overview:\n  \n\n  \nDigital is a rapidly growing and critical area at Dollar Bank.  As the AVP Digital Design you will be responsible for creating an outstanding and unique digital customer experience for our retail and business customers while coordinating consistent branding and look & feel across all digital properties.  This role plays an important and influential role for the business, working closely with product managers, communications professionals, developers and stakeholders to bring the product/service to life. We are seeking a mix of skill sets - including information architecture, wire framing, visual design, interactive design, and prototyping.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Web Design, Interaction Design, Multimedia, Visual Design, or related UX/UI field and minimum 5 years’ experience in interaction or user experience design required. Will consider commensurate experience.\n  \n• Strong portfolio of work showcasing engaging user-centered design solutions.\n  \n• Transactional site design & user experience (online, mobile app, B2C, B2B) preferred.\n  \n• Human interaction experience with digital interfaces required.\n  \n• Proven ability to create, run, and manage customer surveys, design research, and focus groups with customers/non-customers.\n  \n• Familiar with MVC, CSS, jQuery, JavaScript a plus.\n  \n• Working knowledge of CMS.\n  \n• Solid understanding of usability principles, user-centered design methods, and interaction design patterns.\n  \n• Proven ability to maximize SEO results, as well as a solid understanding of optimizing account opening and new customer onboarding via digital.\n  \n• Fluency with InDesign, Illustrator, Photoshop, and Keynote.\n  \n• Practical understanding of HTML 5, JavaScript and CSS preprocessing frameworks.\n  \n• Proven understanding of brand development and representation in the digital space.\n  \n• Ability to create detailed design specifications and mockups to communicate design intent.\n  \n• Understanding of ADA compliance and other design and technical regulations and requirements in the digital space.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Be the UX/UI expert for all digital platforms for retail and business banking.\n  \n• Delivering unique and innovative designs and experiences across multiple applications, products and payments offerings.\n  \n• Turn complex engagements into simple and engaging customer experiences for web, iPad/iPhone, and Android.\n  \n• Create HTML/Java-based wireframes, workflows, storyboards, and navigation maps that deliver a seamless user experience.\n  \n• Effectively communicate and defend design choices, advocating for the customer.\n  \n• Collaborate with digital and bank product managers and developers to understand objectives and constraints.\n  \n• Lead customer research to design and observe user studies and translate research findings into insights and design improvements.\n  \n• Be able to understand the differences and nuances inherent in the major mobile operating systems and device types – iOS, Android, smartphone, tablet.\n  \n• Be able to translate high level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\n  \n• Stay current on and be the SME for competitive UI/UX for banking as well as other digital experiences that influence digital banking customers’ expectations.\n  \n• Work with marketing to maximize SEO results, website management and utilization of bank’s graphic standards.\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  3 Gateway Center Lobby\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:15am - 4:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/C10B294E685A426EB45B3FAAC9F3AB3524",
        "title": "AVP Digital User Experience",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-08 04:09:15"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "3E02D88195D240CD8156DAD81DFFC41B",
        "reqid": "2860BR",
        "description": "Job Overview:\n  \n\n  \nResponsible for working with Information Technology and the Business Areas within Dollar Bank and making sure their needs are understood and delivered, while also ensuring that the needs align with the overall Information Technology strategy.  Develops the Business Requirements (functional and non-functional), Use Cases and required artifacts for projects from initiation through implementation and provides consistent communication with the stakeholders to make sure requirements are being delivered. Follows the adopted Change Management protocol and adheres to project management processes to ensure projects are delivered successfully.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Information Technology or related field required. Will consider commensurate experience\n  \n• Exceptional written and verbal communication that includes good listening skills and an open attitude and acceptance to coaching and being coached\n  \n• Demonstrated experience working on projects\n  \n• Strong organizational and analytical skills\n  \n• Demonstrated organization and team building skills\n  \n• Excellent teamwork and collaboration skills\n  \n• Demonstrated leadership skills\n  \n• Knowledge of Microsoft Office Tools\n  \n• Able to manage simultaneous projects\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Interview Subject Matter Experts to extract the business case for a project and potential impacts\n  \n• Utilize both waterfall and agile development methodologies\n  \n• Facilitate stakeholders on process, strategy, and investments to achieve the enterprise business and IT strategy\n  \n• Negotiate scopes/requirements documentation with stakeholders\n  \n• Aligns with the internal Business Groups to determine their needs, develops business requirements and manage their expectations throughout the project lifecycle\n  \n• Coordinates and facilitates project requirement meetings\n  \n• Maintains communication with all project stakeholders\n  \n• Addresses problems through risk management and contingency planning and presents solutions and/or options to the Project Manager and executive management\n  \n• Monitors effectiveness of project management processes and methodologies; recommends improvements as necessary\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday, 8:00am - 4:15pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/3E02D88195D240CD8156DAD81DFFC41B24",
        "title": "IT Requirements Analyst I",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-08-03 03:34:57"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "D73ABB47673C4CD0B2CBEE8AA2FBF328",
        "reqid": "2845BR",
        "description": "Job Overview\n  \n\n  \nThis position is responsible for providing system health monitoring, troubleshooting, system maintenance and server support for the Distributed Services Infrastructure Support Department. The Department is responsible for the management of over 600 servers, both physical and virtual, over 100 Microsoft SQL Databases, over 150 business applications and over 80 branches throughout the Eastern United States.\n  \n\n  \nQualifications\n  \n\n  \n• Bachelor’s Degree in Computer Science, Information Systems or another related field is required.  Will accept commensurate experience.\n  \n• Minimum of four years’ experience with Microsoft Windows Server and Client Operating Systems is required.\n  \n• Minimum of two years’ experience with PowerShell, DOS Batch, AutoIT, or another scripting language is preferred.\n  \n• Minimum of four years’ experience with VMware, Nutanix or another virtual server technology is preferred.\n  \n• Minimum of four years’ experience with troubleshooting and installing peripheral devices and hardware components such as RAM, CPU, motherboard, etc. is preferred.\n  \n• Minimum of two years’ experience with leading projects is preferred.\n  \n• Minimum of one year experience with Microsoft Visio is preferred.\n  \n• A fundamental understanding of Active Directory, DNS, DHCP, Databases, Virtual Servers, Patch Management and Networking Concepts is preferred.\n  \n• A fundamental understanding of Change Management practices and ITIL best practices is preferred.\n  \n• A fundamental understanding of security concepts is preferred, in particular PII, PCI, SOX, and GLBA.\n  \n• Must be willing to work a variable schedule as needed.  This may include early mornings, evenings, weekends and/or holidays.\n  \n• Must be willing to be on call to support critical systems and services.\n  \n• Must have the ability to work independently with minimal supervision.\n  \n• Must be able to work in a team-oriented environment.\n  \n• Must possess a valid driver’s license and must be willing to travel to branch locations.\n  \n• Must have the ability to be insured on the Bank’s vehicle insurance policy throughout tenure of employment.\n  \n• Must have the ability to lift 25 pounds.\n  \n\n  \nPrinciple Activities and Duties\n  \n\n  \n• Prioritize and work on IT incidents, requests and projects from conception through implementation.\n  \n• Work with team members, business unit personnel, and vendors to design systems as well as configure servers and appliances.\n  \n• Provide troubleshooting of servers, operating systems and application related issues.\n  \n• Monitor the operating systems, troubleshoot and maintain system integrity for bank systems.\n  \n• Monitor the health of systems and servers.\n  \n• Perform general system maintenance of hardware, servers, operating systems, applications, patches and vulnerability management as directed.\n  \n• Create scripts to automate system tasks and processes to improve efficiency.\n  \n• Implement system changes following change control procedures.\n  \n• Provide technical support and escalate incidents to a higher level after appropriate service level agreement.\n  \n• Provide support to level 1 systems administrators.\n  \n• Provide remote and onsite support of desktops, printers, hardware and software.\n  \n• Document systems and solutions.\n  \n• Interact and engage with other team members and business unit personnel.\n  \n• Assist in disaster recovery testing.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/D73ABB47673C4CD0B2CBEE8AA2FBF32824",
        "title": "Systems Administrator Level II",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-07-27 06:37:47"
    },
    {
        "state": "Pennsylvania",
        "country": "United States",
        "state_short": "PA",
        "guid": "BDE7B9B80EB04F5A9F61F939825D3350",
        "reqid": "2600BR",
        "description": "Job Overview:\n  \n\n  \nThe AVP IT Audit assists with the development, implementation, and coordination of the annual audit plan.  The AVP IT Audit plans and supervises concurrent audits of assigned departments, focusing on auditing Dollar Bank’s IT systems / applications and as necessary outsourced systems.  In addition, the AVP IT Audit provides on-the-job training and performance feedback, as applicable, for the Staff and Senior level positions.\n  \n\n  \nQualifications:\n  \n\n  \n• A Bachelor’s degree in Information Systems or related field is required. Master’s degree strongly preferred.\n  \n•A minimum of five years of IT audit experience and/or other IT experience.\n  \n• Supervisory experience is required.\n  \n• Professional Certification is preferred (CISA, CRISC, CISSP, CISM).\n  \n• The AVP IT Audit must also possess an acceptable level of knowledge and/or skills regarding the following:\n  \nACL and TeamMate experience helpful.\n  \nUnderstanding of information technology principles and techniques.\n  \nAbility to communicate effectively; both orally and in writing.\n  \nAbility to coordinate multiple projects and delegate work and responsibility.\n  \nAbility to make sound decisions and provide leadership to the IT Audit staff.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Assist with development of audit plans for IT areas of Bank.\n  \n• Review and evaluate audit procedures and recommend upgrades.\n  \n• Consult with VP IT Audit and Chief Audit Executive regarding audit strategies.\n  \n• Organizes, plans, and conducts audits within the framework established and as assigned by the VP IT Audit and/ or Chief Audit Executive. On selected audits, the AVP IT Audit will also perform all duties associated with the in-charge auditor.\n  \n• Develops and/or approves audit work programs that support the objectives of the review and incorporates those areas of highest risk to the Bank.\n  \n• Monitors audit time and compares with the budget to ensure that audits are completed in a timely manner.\n  \n• Assists VP IT Audit with preparing time analyses for future budgets and audit plans.\n  \n• Participates in the hiring process by interviewing applicants as required.\n  \n• Assists in providing ongoing training for audit staff.\n  \n• Actively involved with computer audit support within the department, as applicable.\n  \n• Actively involved with the coordination of external audit work with the bank’s public accountants, as applicable.\n  \n• Prepares and/or assists with the completion of the annual personnel performance evaluations and the periodic internal evaluations, as applicable, for the audit staff.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http://www.dollar.bank/company/careers/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority/Female/Veteran/Disabled",
        "uid": null,
        "location": "Pittsburgh, PA",
        "company": "Dollar Bank FSB",
        "url": "http://dollarbankcareers.dejobs.org/BDE7B9B80EB04F5A9F61F939825D335024",
        "title": "IT Audit Manager/AVP",
        "city": "Pittsburgh",
        "country_short": "USA",
        "date_new": "2019-02-05 03:34:42"
    }
]